In [1]:
# https://dplyr.tidyverse.org/reference/group_map.html
from datar.datasets import mtcars, iris
from datar.all import *

from nb_helpers import nb_header
nb_header(group_map)

### # group_map

##### Map function to data in each group, returns a list

In [2]:
mtcars >> \
  group_by(f.cyl) >> \
  group_map(lambda df: df >> head(2))

[    mpg  cyl   disp  hp  drat    wt   qsec  vs  am  gear  carb
 2  22.8    4  108.0  93  3.85  2.32  18.61   1   1     4     1
 7  24.4    4  146.7  62  3.69  3.19  20.00   1   0     4     2,
     mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
 0  21.0    6  160.0  110   3.9  2.620  16.46   0   1     4     4
 1  21.0    6  160.0  110   3.9  2.875  17.02   0   1     4     4,
     mpg  cyl   disp   hp  drat    wt   qsec  vs  am  gear  carb
 4  18.7    8  360.0  175  3.15  3.44  17.02   0   0     3     2
 6  14.3    8  360.0  245  3.21  3.57  15.84   0   0     3     4]

In [3]:
mtcars >> \
  group_by(f.cyl) >> \
  group_modify(lambda df: df >> head(2))

    mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
0  22.8    4  108.0   93  3.85  2.320  18.61   1   1     4     1
1  24.4    4  146.7   62  3.69  3.190  20.00   1   0     4     2
2  21.0    6  160.0  110  3.90  2.620  16.46   0   1     4     4
3  21.0    6  160.0  110  3.90  2.875  17.02   0   1     4     4
4  18.7    8  360.0  175  3.15  3.440  17.02   0   0     3     2
5  14.3    8  360.0  245  3.21  3.570  15.84   0   0     3     4

In [4]:
iris >> \
  group_by(f.Species) >> \
  group_map(lambda df: quantile(df['Petal_Length'], probs=c(0.25, 0.5, 0.75)))

[array([1.4  , 1.5  , 1.575]),
 array([4.  , 4.35, 4.6 ]),
 array([5.1  , 5.55 , 5.875])]

In [5]:
iris >> \
  group_by(f.Species) >> \
  group_walk(lambda df: print(df >> head(2)))

   Sepal_Length  Sepal_Width  Petal_Length  Petal_Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
    Sepal_Length  Sepal_Width  Petal_Length  Petal_Width     Species
50           7.0          3.2           4.7          1.4  versicolor
51           6.4          3.2           4.5          1.5  versicolor
     Sepal_Length  Sepal_Width  Petal_Length  Petal_Width    Species
100           6.3          3.3           6.0          2.5  virginica
101           5.8          2.7           5.1          1.9  virginica

In [6]:
mtcars >> \
  group_modify(lambda df: df >> head(2))

                mpg  cyl   disp   hp  drat     wt   qsec  vs  am  gear  carb
Mazda RX4      21.0    6  160.0  110   3.9  2.620  16.46   0   1     4     4
Mazda RX4 Wag  21.0    6  160.0  110   3.9  2.875  17.02   0   1     4     4